num = int(input())
# ИСПРАВИТЬ: лучше бы справиться за один вызов функции print()
print(f'Следующее за числом {num} число:', num + 1)
print(f'Для числа {num} предыдущее число:', num - 1)

# ИСПОЛЬЗОВАТЬ: длинные литералы удобно записывать на нескольких строчках кода следующим образом:
# >>> ('первая строчка длинной строки\n'
# ...  'вторая строчка длинной строки')
# 'первая строчка длинной строки\nвторая строчка длинной строки'
# >>>
# КОММЕНТАРИЙ: в круглых скобках (в том числе и в круглых скобках функций) записаны два строковых литерала, которые при вычислении объединяются в один с помощью неявной конкатенации — вне круглых скобок потребуется явная конкатенация


# 20
# Следующее за числом 20 число: 21
# Для числа 20 предыдущее число: 19


# ИТОГ: хорошо, но можно лучше — 2/3
